import streamlit as st 

"# 迷彩綠與 108 位平頭男子"

st.image('https://images.unsplash.com/photo-1508248467877-aec1b08de376?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1674&q=80')

"""
###
### 後腦勺
理平頭的時候，新兵分成兩排坐著。我盯著對面的剃刀，試著不去關注落下的頭髮。現實的成果，不像《那些年》演的那麼熱血帥氣；不過意外的是，平頭順著摸是軟的，逆著摸是刺的，讓我想到小時候幫家犬理毛之後的觸感。

「很好摸耶。」旁邊的新兵與我一起摸著各自的平頭，場面有點逗趣。

排隊伍時，只要你是直視前方，不論是左轉彎、右轉彎、向後轉，你永遠只會看到別人的後腦勺。

###
### 背景
由於高，我在部隊當「班頭」，這也是我唯一的綽號。日常的相處，你不必知悉別人的名子。點名時，只要說：「報告班長，九班除 85 號上廁所外，其餘到齊。」

第二天與鄰兵聊為什麼當兵，我才知道成為「補充兵」有多種原因：帶傷、過瘦過胖、家庭因素、有小孩、抑或是現役國手，都有可能。

穿著一樣的迷彩綠服裝、折出一樣的豆腐型棉被，外在的標籤就也都去除了。但從簽名的字跡、頭型的弧度、談吐的內容，還是可以猜出一個人的受多少教育，幼兒時受多少關心（據說，跟媽媽抱著比起來，假如嬰兒一直躺在床上，頭型會比較扁）。

如果不開口，或許很難猜到這 108 個人來自是什麼背景：念法律、資工或氣候變遷的、操作怪手的、混社會的；遇到了大學生、休學生、留學生；還有壽險主管、超商店長、體育金牌、護理師、大盤物流商之子。

我發現自己有著對人的好奇，有機會就開口找人說話。當時一位弟兄說：「平常就算跟最好的朋友，也頂多一起玩四天三夜。像當兵這樣共同生活十二天，還真特別。」
###
"""

col1, col2 = st.columns(2)
with col1: 
    st.image('https://images.unsplash.com/photo-1600795581415-2c921178cc2a?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80')
with col2: 
    st.image('https://images.unsplash.com/photo-1587465404798-f679d37279de?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=987&q=80')
"""
###
### 閱讀
我發現在群體身活中自主時間，相當必要。例如閱讀。當兵最深刻的時光，就讀吳明益的短篇小說集《苦雨之地》。軍中空白的作息，自然就使文字的顏色變得鮮明。作者對自然的深入描繪，使營區生活的迷彩綠，注入了海洋藍與山林綠，這也是我如何感受到「被文學擊中的激動」。

讀 Ray Dalio 的《原則》也是一樣，閱讀速度放慢，才能理解一些經濟學名詞，而產生感受。我抄下帶有疑問的詞彙，請教經濟學背景的同梯學長，談得愉快。但當我讀到書中對人生與工作建議的章節，反而進行不下去。比起學習他人的建議，現在的我頃向消化自身的經驗。

###
### 義氣
步三營兵器連從班長到連長都有值得敬佩之處，不但會為我們付出額外的關心，甚至期待我們用各自的方式貢獻社會。那些關心跟期待都是需要的心力的，我對他們的敬佩也來自於理解他們的精神。

寢室睡覺前，我們開玩笑地重複著軍中口令、模仿連長的語氣、或是求班長講鬼故事。對話的時間，是服役的溫度。

話說回來，床鋪是聯通的。其實寢室間不會因為你過去是誰，而有所隔閡。有一次鄰兵發現室內管線上的空鳥巢，取下來發現裡面只有顆石頭，上面用馬克筆畫著一隻鳥。遇到無傷大雅的惡作劇，大家也都是笑在一起。

在當兵時間去世的 C ，生前很帥，那種弟兄混起來富有義氣的帥。他曾在我的退伍合照上簽名，也常常跑來跟我借濕紙巾。我們同年生，但是他有著我所沒有的經驗（我問他身上的刺青是不是要一萬五，他看穿我是外行人地回答，遠遠不止）。

在營區行走，班長要求成五路並直視前方的平頭。退伍前兩天，108 個兵走在柏油路上，而當下我將視線上移，凝視新竹的雲、陽、以及遠方的山巒。衡量著：這會不會將是我所懷念的日子？

108 個新兵，頭髮才長出一點就退伍了。每個人都希望平安順利回到家人身邊，或許表面上不會強烈的說想家，但是內心深處都是如此。

2020.6.8 — 2020.6.19 於新竹關西
"""

#